document.querySelector('#graph').querySelector('table').style= `height:${document.querySelector('#graph').querySelector('table').clientWidth}px`
document.querySelector('article').querySelectorAll('div')[1].addEventListener('click',()=>{
    location.replace('./registiration.html')
})

window.addEventListener('resize',()=>{
    document.querySelector('#graph').querySelector('table').style= `height:${document.querySelector('#graph').querySelector('table').clientWidth}px`
})
document.querySelector('#signOut').addEventListener('click',()=>{
    localStorage.removeItem('DISCData');
    location.replace('./registiration.html')
})
/****************************************************/
if(localStorage.getItem('DISCData') == null){
    document.querySelectorAll('section').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('h1').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('header').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('nav').forEach((e)=>{
        e.classList.add('hidden')
    })
}
else{
    document.querySelector('article').classList.add('hidden')
    let data2 = localStorage.getItem('DISCData');
let data = JSON.parse(data2);
let navs = document.querySelector('nav').querySelectorAll('div')
function makeLines(r1,r2,r3,r4){
    let line1 = document.querySelector('#line1');
    let line2 = document.querySelector('#line2');
    let line3 = document.querySelector('#line3');
    //Marking on the rows to be matched
    rows[r1].querySelectorAll('td')[0].innerHTML='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'
    rows[r2].querySelectorAll('td')[1].innerHTML='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'
    rows[r3].querySelectorAll('td')[2].innerHTML='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'
    rows[r4].querySelectorAll('td')[3].innerHTML='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'
    //deleting the other rows
    for(let g=0;g<rows.length;g++){
      if(rows[g].querySelectorAll('td')[0].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'){
        rows[g].querySelectorAll('td')[0].innerHTML='';
      }
      if(rows[g].querySelectorAll('td')[1].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'){
        rows[g].querySelectorAll('td')[1].innerHTML='';
      }
      if(rows[g].querySelectorAll('td')[2].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'){
        rows[g].querySelectorAll('td')[2].innerHTML='';
      }
      if(rows[g].querySelectorAll('td')[3].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'){
        rows[g].querySelectorAll('td')[3].innerHTML='';
      }
      if(rows[g].querySelectorAll('td')[0].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'&&rows[g].querySelectorAll('td')[1].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'&&rows[g].querySelectorAll('td')[2].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>'&&rows[g].querySelectorAll('td')[3].innerHTML!='<span style="display:inline-block;border-radius:50%;border:8px solid #524438;box-shadow:0 0 1px black"></span>')
      rows[g].classList = 'hidden'
    }
    //setting up the coordinates of the lines
    line1.setAttribute('x1',rows[r1].querySelectorAll('td')[0].offsetLeft+0.5*(rows[r1].querySelectorAll('td')[0].clientWidth))
    line1.setAttribute('y1',rows[r1].querySelectorAll('td')[0].offsetTop+0.5*(rows[r1].querySelectorAll('td')[0].clientHeight))
    line1.setAttribute('x2',rows[r2].querySelectorAll('td')[1].offsetLeft+0.5*(rows[r2].querySelectorAll('td')[1].clientWidth))
    line1.setAttribute('y2',rows[r2].querySelectorAll('td')[1].offsetTop+0.5*(rows[r2].querySelectorAll('td')[1].clientHeight))
    line2.setAttribute('x1',rows[r2].querySelectorAll('td')[1].offsetLeft+0.5*(rows[r2].querySelectorAll('td')[1].clientWidth))
    line2.setAttribute('y1',rows[r2].querySelectorAll('td')[1].offsetTop+0.5*(rows[r2].querySelectorAll('td')[1].clientHeight))
    line2.setAttribute('x2',rows[r3].querySelectorAll('td')[2].offsetLeft+0.5*(rows[r3].querySelectorAll('td')[2].clientWidth))
    line2.setAttribute('y2',rows[r3].querySelectorAll('td')[2].offsetTop+0.5*(rows[r3].querySelectorAll('td')[2].clientHeight))
    line3.setAttribute('x1',rows[r3].querySelectorAll('td')[2].offsetLeft+0.5*(rows[r3].querySelectorAll('td')[2].clientWidth))
    line3.setAttribute('y1',rows[r3].querySelectorAll('td')[2].offsetTop+0.5*(rows[r3].querySelectorAll('td')[2].clientHeight))
    line3.setAttribute('x2',rows[r4].querySelectorAll('td')[3].offsetLeft+0.5*(rows[r4].querySelectorAll('td')[3].clientWidth))
    line3.setAttribute('y2',rows[r4].querySelectorAll('td')[3].offsetTop+0.5*(rows[r4].querySelectorAll('td')[3].clientHeight))
  }
  let rows = [];
  let rows1 = document.querySelector('#graph').querySelectorAll('tr');
  for(let l=1;l<rows1.length;l++){
    rows.push(rows1[l])
  }
  console.log(rows1,rows)
  for(let g=0;g<rows.length;g++){
    if((parseInt(rows[g].querySelectorAll('td')[0].innerHTML))==data.D){
      r11=g;
    }
    if((parseInt(rows[g].querySelectorAll('td')[1].innerHTML))==data.I){
      r22=g;
    }
    if((parseInt(rows[g].querySelectorAll('td')[2].innerHTML))==data.S){
      r33=g;
    }
    if((parseInt(rows[g].querySelectorAll('td')[3].innerHTML))==data.C){
      r44=g;
    }
  }
  makeLines(r11,r22,r33,r44)

console.log(data)
document.querySelector('#table').querySelectorAll('tr').forEach((e,i)=>{
    if(i==1){
        e.querySelectorAll('td')[1].innerHTML = data.maxa
        e.querySelectorAll('td')[3].innerHTML = data.mina
        e.querySelectorAll('td')[5].innerHTML = data.D
    }
    if(i==2){
        e.querySelectorAll('td')[1].innerHTML = data.maxb
        e.querySelectorAll('td')[3].innerHTML = data.minb
        e.querySelectorAll('td')[5].innerHTML = data.I
    }
    if(i==3){
        e.querySelectorAll('td')[1].innerHTML = data.maxc
        e.querySelectorAll('td')[3].innerHTML = data.minc
        e.querySelectorAll('td')[5].innerHTML = data.S
    }
    if(i==4){
        e.querySelectorAll('td')[1].innerHTML = data.maxd
        e.querySelectorAll('td')[3].innerHTML = data.mind
        e.querySelectorAll('td')[5].innerHTML = data.C
    }
})

window.addEventListener('resize',()=>{
  makeLines(r11,r22,r33,r44)
  r()
})

/*******************************************************************/
let charactersArr = [],charactersArr2 = [],charactersArr11 = [],charactersArr22 = [],charactersArr33 = []
if(data.mode.includes('D')||data.mode.includes('I')||data.mode.includes('S')||data.mode.includes('C')){
    document.querySelectorAll('section').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('h1').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('header').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelectorAll('nav').forEach((e)=>{
        e.classList.add('hidden')
    })
    document.querySelector('article').classList.remove('hidden')
}
if(data.mode == 'أ المسيطر'||data.mode == 'D-Dominant'){
    charactersArr.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    if(data.mode2 == 'أ المهيمن'){
        charactersArr2.push('ميل شديد للسيطرة إلى درجة الهيمنة، قوي، عدم مراعاة المشاعر، عدم الدخول في التفاصيل، يمارس التغيير بسرعة وبشكل جذري، عملي ومنجز بشكل كبير، رسمي جدا، أوامره مباشرة وحازم جدا.','يصلح للقيادة العليا للمشاريع الهامة قصيرة المدي،بدون مراعاة للشعور أو الدخول في التفاصيل.')
    }
    if(data.mode2 == 'ب المتوازن'){
        charactersArr2.push('من أفضل أنواع القيادات، مسيطر مع مراعاة للمشاعر، قيادي مع الدخول في شيء من التفاصيل، يحب العمل مع القيادات العليا والوسطى، يمارس التغيير بسرعة وبشكل جذري، عملي ومنجز، محب للإبداع والتنظير، قيادي متميز.','يصلح للقيادة العليا للمشاريع الهامة قصيرة المدى ،بدون مراعاة للشعور مع شيء من مراعاة المشاعر والتفاصيل.')
    }
    if(data.mode2 == 'ج المتأرجح'){
        charactersArr2.push('قوي، يحاول أن يوازن بين الإنجاز والعلاقات، عملي، منجز، يراعي المشاعر، محترم، يدخل في القليل من التفاصيل الهامة، لديه مشكلة أنه يتأرجح بين السرعة والتدرج، وكذلك بين العلاقات والعمل دون استقرار','يصلح للقيادة العليا طويلة المدى، وللمشاريع الهامة بشرط أن يتعلم التوازن.')
    }
    if(data.mode2 == 'د العملي'){
        charactersArr2.push('قيادي ومسيطر وعملي جدا، يدخل في أدق التفاصيل، لا يراعي المشاعر، ويقدم الإنجاز على العلاقات . سريع ولكن أقل من باقي أنماط المسيطر، مرکزي، وكثيرالأوامر، ويحب التحليل والدراسات .','يصلح للقيادة العليا في الأعمال التي لا تتحمل أي أخطاء، وللمشاريع قصيرة المدى كذلك.')
    }
}
if(data.mode == 'ب المؤثر'||data.mode == 'I-Influential'){
    charactersArr.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    if(data.mode2 == 'أ المحفز'){
        charactersArr2.push('میل شديد لتشجيع الناس وتحفيزهم وحرص على حبهم ونفعهم، قوي، مبدع، منظر، مع عدم الدخول في التفاصيل، يمارس التغيير السريع والجذري، منجز ولكن أقل من المسيطر.','يصلح للقيادة الجماهيرية أو الإعلامية، وكذلك التنظير والتخطيط والإبداع (دون الدخول في التفاصيل).')
    }
    if(data.mode2 == 'ب المقنع'){
        charactersArr2.push('أفضل أنواع القيادات، فهو قوي ومنظر ومبدع ومحبوب، ولديه توازن معقول بين الإنجاز والعلاقات مع ميل لمراعاة المشاعر، لا يحب التفاصيل ولكن لديه القدرة عليها إن استدعى الأمر، لديه قدرة عالية جدا على الإقناع .','يصلح للقيادة العليا طويلة المدى، وكذلك الإعلامية، ويحب التخطيط والإبداع والإقناع.')
    }
    if(data.mode2 == 'ج الناصح'){
        charactersArr2.push('ميل شديد للعلاقات والتشجيع والتحفيز، حريص على حب الناس ونفعهم ونصحهم، ولكن على حساب الإنجاز والنتائج، يدخل في التفاصيل التي لها علاقة بمشاكل الناس ورضاهم ويحب التنظير والتخطيط والإبداع كذلك.','يصلح للقيادة الجماهيرية في المجالات الاجتماعية والأسرية والتربوية بشكل خاص) ومبدع في هذه المجالات.')
    }
    if(data.mode2 == 'د المتأرجح'){
        charactersArr2.push('مؤثر ومقنع ومحبوب واجتماعي، لكنه يفرط في هذا أحيانا على حساب العمل والإنجاز مما يجعله يتوقف ويدخل في التفاصيل ويحزم ولا يراعي المشاعر، مما يجعل الناس يتضايقون منه، فيعود لمحاولة كسب حبهم ورضاهم، فيفلت العمل وهكذا يظل متأرجحا بين النمطين.','يصلح للقيادة العليا في الأعمال التي لا تتحمل أي أخطاء ، وللمشاريع قصيرة المدى كذلك بشرط أن يتعلم التوازن.')
    }
}
if(data.mode == 'ج المحافظ'||data.mode == 'S-Steady'){
    charactersArr.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
    if(data.mode2 == 'أ الخدوم'){
        charactersArr2.push('ميال للأعمال التي فيها احتكاك بالناس، مع قليل من التفاصيل الرسمية، يحب إرضاء الناس وخدمتهم، لديه شيء من الإبداع والاستعداد','يصلح للقيادة الوسطى أو الإشرافية التي فيها احتكاك بالناس وقليل من التفاصيل الرسمية.')
    }
    if(data.mode2 == 'ب الإجتماعي'){
        charactersArr2.push('ميال بشدة للأعمال التي فيها احتكاك بالناس والإبداع كذلك، ولا يميل إطلاقا للأعمال الرسمية، منفتح ومحبوب ولطيف الكلام، ناجح في العلاقات العامة والإعلام.','يصلح للقيادة العليا أو الوسطى في الأعمال قليلة الرسمية كثيرة الاحتكاك بالناس.')
    }
    if(data.mode2 == 'ج المتأرجح'){
        charactersArr2.push('حريص على رضا الناس ولكن على حساب العمل، وعندما تحدث المشاكل يتخلى عن رضاهم ويصبح رسميا، وعندما ينزعج الناس يتخلى عن العمل من أجلهم وهكذا دون وسطية.','يصلح للقيادة الوسطى أو الإشرافية التي فيها احتكاك كبير بالناس مع شيء من التفاصيل بشرط أن يتعلم التوازن.')
    }
    if(data.mode2 == 'د المتدرج'){
        charactersArr2.push('متوازن بين الإنجاز والعلاقات مع ميل الإرضاء الناس على حساب العمل أحيانا، لا يحب التغييرات الكبيرة ويفضل التدرج والاستقرار واللوائح والنظم والعمل بتطور خطوة خطوة.','يصلح للأعمال الإشرافية التي فيها احتكاك بالناس مع شيء من التفاصيل والتي لا تتطلب سرعة أو قفزات.')
    }
}
if(data.mode == 'د الواعي'||data.mode == 'C-Conscientious'){
    charactersArr.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
    if(data.mode2 == 'أ الدقيق'){
        charactersArr2.push('میل شديد للتفاصيل والنواحي العملية ، وقلة واضحة في العلاقات والمرح والكلام ، عدم مراعاة للمشاعر ، ميل شديد للنظم واللوائح وكره لعدم الاستقرار والتغيير','يصلح للأعمال الرسمية التفصيلية الدقيقة التي يقل فيها الاحتكاك بالناس.')
    }
    if(data.mode2 == 'ب المتدرج'){
        charactersArr2.push('متوازن بين الإنجاز والعلاقات مع ميل للرسمية والتفاصيل، لا يحب التغييرات الكثيرة وكسر اللوائح والنظم ويميل للتدرج والتطور خطوة خطوة.','يصلح للأعمال الإشرافية التفصيلية الدقيقة والتي فيها احتكاك محدود بالناس.')
    }
    if(data.mode2 == 'ج المتأرجح'){
        charactersArr2.push('مهنية عالية بالاهتمام بالتفاصيل ولكن على حساب العلاقات وعندما تحدث المشاكل مع الناس يتخلى عن مهنيته قليلا ليرضيهم، فإذا اختل العمل رجع إلى رسميته وهكذا يظل متأرجحا بين النمطين دون وسطية.','يصلح للقيادة الوسطى أو الإشرافية التي فيها احتكاك بالناس مع تفاصيل تنفيذية كثيرة بشرط أن يتعلم التوازن.')
    }
    if(data.mode2 == 'د المشرف'){
        charactersArr2.push('اهتمام واضح بالتفاصيل مع عدم مراعاة للناس، وحب شديد للعمل وميل أكثر للقيادة الإشرافية القريبة من الوظائف العملية المباشرة التي تتطلب دقة مع قليل من القيادة، ومع بعد عن الاحتكاك بالناس.','يصلح للأعمال الإشرافية التي فيها تفاصيل وبعض الأعمال القيادية وقليل من الاحتكاك بالناس.')
    }
}
if(data.mode == 'ه الموفق'||data.mode == 'N-Facilitator'){
    charactersArr.push('متوازن بين العلاقات والإنجاز، ومتوسط في سرعته في التغيير ، في الوسط في كل الصفات تقريبا كالإبداع والتطوير والمرح والانفتاح والجرأة والقوة والإنتاج وغيرها','المزيد من الإبداع والتخطيط والاستراتيجي والتغيير وبناء العلاقات والإلقاء والتنظير والتفكير الإبداعي ، ويحتاج للاحتكاك أكثر بالقيادات العليا والتعلم منها وخاصة أنه قادر على ذلك','القيادة الوسطى حيث لديه القدرة على التعامل مع القيادات العليا وكذلك القيادات الإشرافية، وقادر على الدخول في التفاصيل ومتابعتها وفي نفس الوقت بناء العلاقات مع الناس','بسبب وسطيته وتوازنه فهو قادر على التعامل مع كل الأنماط','يستطيع التعامل مع كل أنواع القادة ، وإن كان يفضل المؤثر ثم المسيطر','بسبب وسطيته وتوازنه فالموفق سهل في التعامل ، ولا يحتاج لأي قدرات خاصة أو تعامل مختلف','لا يوجد لك صفات إضافية')
    if(data.mode2 == 'أ الموفق المسيطر'){
        charactersArr2.push('يتمتع بكل الصفات للموفق مع ميل للرسمية والاهتمام بالعمل والحرص على الإنجاز مع قليل من التفاصيل.','الأعمال القيادية دون الوسطى التي فيها احتكاك بالناس.')
    }
    if(data.mode2 == 'ب الموفق المؤثر'){
        charactersArr2.push('يتمتع بكل صفات الموفق مع شيء من صفات المؤثر وبالذات بناء العلاقات والقدرة على الحديث والتنظير','الأعمال القيادية دون الوسطى والتي تتطلب متابعة التفاصيل والدقة فيها.')
    }
    if(data.mode2 == 'ج الموفق المحافظ'){
        charactersArr2.push('يتمتع بكل صفات الموفق مع حرص على رضا الناس وخدمتهم ومتابعة احتياجاتهم .','الأعمال القيادية فوق الوسطى التي تحتاج إلى حزم ورسمية مع قليل من التفاصيل.')
    }
    if(data.mode2 == 'د الموفق الواعي'){
        charactersArr2.push('يتمتع بكل صفات الموفق مع حرص على التفاصيل ومتابعتها والتدقيق عليها .','الأعمال القيادية فوق الوسطى التي فيها احتكاك بالناس أو تغييرات كثيرة.')
    }
}
if(data.mode=='أ,ب,ج'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    charactersArr33.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
}
if(data.mode=='أ,ب,د'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    charactersArr33.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
if(data.mode=='ب,ج,د'){
    charactersArr11.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    charactersArr22.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
    charactersArr33.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
if(data.mode=='أ,ج,د'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
    charactersArr33.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
if(data.mode=='أ,ب'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
}
if(data.mode=='ب,ج'){
    charactersArr11.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    charactersArr22.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
}
if(data.mode=='ج,د'){
    charactersArr11.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
    charactersArr22.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
if(data.mode=='أ,د'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
if(data.mode=='أ,ج'){
    charactersArr11.push('جريء، سريع الإنجاز، قليل العلاقات سوى الرسمية، كثير الإنتاج، مصمم، معتز برأيه، مقدام، لا يرحم عند العمل، كلامه قوي، شجاع، موجه للآخرين، قوي، محب للإنجاز، قوي الإرادة، طموح، يفوز عند الجدل، مغامر، سريع وعملي، عملي، صريح، مبدع، العمل أولا، حازم، قلق على العمل، مسيطر، قوي الشخصية، يقبل التحدي، ريادي.','تخفيف السيطرة ، أن يستعمل الكلمات اللطيفة والمجاملة أكثر ، أن يفوض أكثر، عدم الاستعجال في اتخاذ القرارات ، ألا ينزعج إذا لم يكن الأول ، الصبر وعدم استعجال النتائج ، المشاورة أكثر، مراعاة النفسيات والمشاعر ، إعطاء جزء أكبر من وقته للناس ، تخفيف الأوامر ، الاسترخاء وعدم التوتر والقلق باستمرار، تخفيف المثالية وتقبل " أحسن الممكن " ، تخفيف مدح النفس ، شكر الفريق الذي يعمل معه وأن ينسب العمل لهم، تخفيف نقد الآخرين ، مراجعة التفاصيل الهامة .','الأعمال القيادية، الواضحة، قصيرة المدى ( مشاريع )، فيها تحد، وتحتاج لقرارات حازمة، وإبداع عملي ، وفيها إنجازات كبيرة، لا يحب الدخول في التفاصيل، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','عمليون ، مطيعون ، ولاؤهم عالي ، قليلو الكلام ، قليلو الأخطاء ، يتحملون العمل الشاق المتواصل ( نمط الواعي والمحافظ)','أفضل من يقوده هو نمط "المؤثر" حيث يستطيع استيعابه ويراعيه ويعطيه مساحة من الحرية للحركة والقرار، وفي نفس الوقت لديه قدرة على تزويده بالاقتراحات المبدعة والتنظير الضروري مع مراعاة مشاعره.','الاحترام، الثناء، الالتزام الشديد بالاتفاقات معه، تأجيل النصح والاقتراحات إلى وقت الهدوء والفراغ (وليس أثناء حرارة العمل)، العمل بجد وإنجاز كبير معه، الصبر على أوامره وقسوته" فهو يقصد المصلحة.','يحب البروز، أوامره مباشرة ، يسأل كثيرا ليفهم ، قراراته حازمة وسريعة . <hr>حريص على الفوز، ينسب النجاح لنفسه ، يكثر من الحديث عن فشل من سبقه<hr>يستمتع بتولي المسؤوليات الجديدة ، يريد الحصول على نتائج سريعة<hr> يعرف ما يريد ويسعى له ، لا يراعي المشاعر كثيرا ، مرکزي، ينزعج جدا عند الفشل .<hr>علاقاته غير عميقة (وإنما للمصالح غالبا)، يهمش دور من حوله ، يقاطع الحديث .<hr>يعمل في أكثر من مشروع في نفس الوقت ، يفرض رأيه ولا يغيره بسهولة<hr>شخصيته طاغية على من حوله، (ولذا يهابونه أكثر مما يحبونه).')
    charactersArr22.push('دبلوماسي، لين الطبع، علاقاته واسعة، مرضي لمن حوله، طيب، آراؤه معتدلة، کریم، مجامل، لا ينفعل بسهولة، اجتماعي، متعاون مع الآخرين، مؤدب، محب لرضا الناس، محب للمساعدة، منفتح، هادئ الحديث، معتدل، متدرج واجتماعي، ودود، مهدئ للآخرين، لطيف، يراعي المشاعر، متعاطف، متعاون جدا، متفاعل، سهل الإرضاء، مؤدب، محبوب','الدقة في العمل ، ومزيد من الانضباط ، التنظير والإبداع والتفكير الابتكاري والتخطيط الاستراتيجي والتشغيلي ، والتفكير في القضايا الكبرى والمشاكل العامة ، ويخفف من العلاقات التي تضيع وقته ، ويتعلم فنون المتابعة والرقابة، وألا يقاوم التغيير ، ويحتاج لمزيد من الصراحة والوضوح وتخفيف المجاملات المؤثرة سلبا على العمل .','الأمور العملية التي فيها احتكاك بالناس ، ويحب اللوائح والنظم ويكره عدم الاستقرار، ولا مانع لديه ألا يكون مسئولا، ولديه ثبات وصبر على نفس العمل المدة طويلة . يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','يمكنه العمل مع كل الأصناف ويتحملهم جميعا سواء كان قائدا لهم أو مقودا','أفضل من يديره هو النمط المؤثر ، ولكن يمكن لكل الأنماط أن تقوده','الوضوح والنظام واللوائح مع شيء من الحرية عند التعامل مع الناس لكسب رضاهم . عدم تفويضه في الأمور التي تحتاج إلى دقة بل لا بد من المتابعة بعده','فوضوي وخاصة في أوقاته وأوراقه، تفوته التفاصيل ولذا تتكرر منه الأخطاء.<hr>يحب الحركة وعدم الجلوس على المكتب ، يحب العمل مع فريق.<hr>له دور كبير في حل المشاكل والنزاعات ، مرن ويغير موقفه بسهولة لإرضاء الناس.<hr>مستمع جيد ، يحب أن يعرف ماذا يتوقع منه الآخرون.<hr>يتعامل بسهولة مع أنواع مختلفة من الناس.<hr>لا يحب المفاجآت في العمل ، يحب المدح والثناء ، حزمه قليل ، ويتأخر في اتخاذ القرارات.')
}
if(data.mode=='ب,د'){
    charactersArr11.push('متحمس، كثير التفويض، مؤثر على الآخرين، يحرك الآخرين للإنتاج، مقنع، مثير للتفكير، مبهر، جذاب، بارع شفويا، ملهم، مشجع، مفکر، محب للتنظير، محبوب، عالي المعنويات، خالي من الهموم، لا تهمه التفاصيل، سريع واجتماعي، منفتح، مرح، مقنع، ينشرالسرور حوله، واثق، مفوض، مغامر، قادر على الدهاء، حيوي، متفائل.','تخفيف التنظير والعلاقات والتركيز أكثر على العمل والإنجاز ، عدم تجاوز التدقيق في التفاصيل الهامة ، الالتزام أكثر بالمواعيد النهائية للأعمال ، الحزم أكثر، عدم الاكتفاء بالخطط الاستراتيجية والدخول أكثر في الخطط التشغيلية ، إتقان الإدارة والتنظيم والرقابة ، عدم المشاورة في كل شيء (قرر في الأمور المستعجلة أو البسيطة).','الأعمال القيادية التي تحتاج إلى تنظير وإبداع ، وفيها تحدي كبير، أو قيادة أعداد كبيرة من الناس ، يحب المشاركة في التخطيط الاستراتيجي والتغيير الجذري ، يحب الخطابة والحديث للجماهير والبروز الإعلامي ، لا يحب الدخول في التفاصيل ، يفضل القرار الجماعي ( وإن كان لديه القدرة على الحزم عند الحاجة ) ، ملول ويحب تغيير العمل أو المنصب كل 3-5 سنوات.','يعمل بسهولة مع كل أنماط الناس ، وإن كان لا يطيق التقليديين ، لديه قدرة خاصة على قيادة نمط المسيطر، وكذلك يقود أمثاله من المؤثرين ، لا بد أن يكون بعض أعضاء الفريق من نمط المحافظ حتى يغطي استعجاله وعدم دخوله في التفاصيل.','يتحمل كل أنواع القادة لكونه مراعيا للمشاعر ، ولا يفضل أن يقوده المسيطر، ويفضل أن يقوده المؤثر لأنه يفهم تنظيره وانفتاحه وإبداعه ويراعي مشاعره واهتماماته.','إعطاؤه مساحة كبيرة من الحرية ، إشراكه في التخطيط والتغيير ، والوضوح والصراحة بأدب، إيجاد طريقة مناسبة لتغطية استعجاله وعدم دخوله في التفاصيل، ولأنه سريع الثقة بالناس فلا بد من وجود من يحذره وينبهه باستمرار .','يكسب الأصدقاء بسرعة، يترك انطباعا إيجابيا (حتى مع الغرباء) من أول مرة .<hr>دافئ ولطيف، يثق في الناس أكثر من اللازم ، يحب إثارة إعجاب الآخرين .<hr>يستمتع بالمدح والثناء (وقد يستحقه فعلا)، متحدث بارع ، يعشق الحرية.<hr>لا يحب الرسميات ، وقته ومواعيده النهائية مرنة نسبيا.<hr>يحزم غالبا ولكنه يتأخر أحيانا في الحزم ، مستمع جيد.<hr>ينسب العمل للفريق ويفوض كثيرا ، يعمل في أكثر من مشروع في نفس الوقت.<hr>يحب النظر في أصول الأمور وليس أشكالها.<hr>تفوته الكثير من التفاصيل مما يسبب له المشاكل.')
    charactersArr22.push('راضي، قوي الملاحظة، حريص في اختيار علاقاته، جاد في عمله، حريص، آراؤه واضحة، منطقي، قنوع، كلامه هادئ، حذر، معتمد على نفسه، عملي، محب للأصالة، حريص على العمل، متقن، منظم، قليل الأخطاء، متدرج وعملي، رسمي، غير فضولي، متواضع، يفضل الخصوصية، حيادي، قليل الأخطاء، واعي، نادر الأخطاء، منضبط، راقي.','فن بناء العلاقات وإصلاحها ، مزيد من المرح ، الإبداع ، التخطيط الاستراتيجي، بناء فريق العمل ، الاتصال ، التحفيز، التنظير والتفكير الابتكاري ، يحتاج أن يفكر في القضايا والمشاكل العامة والكبيرة ويخفف من التركيز على التفاصيل، يحتاج أن يخفف من المثالية ، وأن يتحمل أخطاء الناس ، ويكون مرنا معهم، ويحتاج ألا يقاوم التغيير','الأمور العملية التفصيلية التي فيها احتكاك قليل بالناس، لا يميل إلى المجاملة ، ويحب الصراحة والوضوح والنظام الواضح واللوائح الدقيقة المفصلة ، لا مانع لديه ألا يكون مسؤولا، ولديه ثبات بحيث يصبر على نفس العمل لفترات طويلة','يحب أن يقود أو يعمل مع أناس من نمطه فقط ، ولا يتحمل المؤثر إطلاقا حيث يختلف معه دوما ، ويصعب عليه أن يقود المسيطر، ولكنه قادر أن يقود المحافط إن احتاج لذلك','أفضل من يقوده هو المسيطر، ولكن كل الأنماط يمكن أن تقوده','الوضوح والنظام واللوائح والتعليمات المحددة، وإعطاؤه أعمال تفصيلية عملية، وإبعاده عن الأمور التي تحتاج لعلاقات واحتكاك بالناس، الاعتماد عليه والوثوق به في الأمور التفصيلية','مبالغ في الترتيب والتنظيم ، ينزعج جدا عند الخطأ.<hr>يحب الهدوء ، ينتقد جودة العمل باستمرار.<hr>لا يبني علاقات جديدة بسهولة.<hr>لا يحب المقاطعات وتوتره ، يحب المعايير والمقاييس كثيرا ، يفضل المهارات العملية وليست النظرية.<hr>ينزعج ويتوتر بشدة إذا حدث خلاف حوله ولكنه يميل للعزلة عندها.')
}
/***************************************/
if(data.mode.includes(',')==false&&data.mode2!='لا يوجد لك نمط تفصيلي'){
    document.querySelector('section').querySelector('section').querySelectorAll('div')[8].innerHTML = charactersArr[0]
    document.querySelector('#res2').classList.remove('hidden')
    document.querySelector('#resBox').querySelectorAll('section')[0].querySelector('h1').innerHTML = `النمط الرئيسي: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode}</span>`
    document.querySelector('#resBox').querySelectorAll('section')[1].querySelector('h1').innerHTML = `النمط الفرعي: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode2}</span>`
    document.querySelectorAll('.common').forEach((elment)=>{
        elment.querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
            e.addEventListener('click',(evt)=>{
                evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                    elem.style=''
                })
                evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr[i]
                evt.target.style= 'border:0px;background-color:unset';
            })
        })
    })
}
else if(data.mode.includes(',')==false&&data.mode2=='لا يوجد لك نمط تفصيلي'){
    document.querySelector('section').querySelector('section').querySelectorAll('div')[8].innerHTML = charactersArr[0]
    document.querySelector('#resBox').querySelectorAll('section')[0].querySelector('h1').innerHTML = `النمط الرئيسي: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode}</span>`
    document.querySelector('#resBox').querySelectorAll('section')[1].querySelector('h1').innerHTML = `النمط الفرعي: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode2}</span>`
    document.querySelectorAll('.common').forEach((elment)=>{
        elment.querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
            e.addEventListener('click',(evt)=>{
                evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                    elem.style=''
                })
                evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr[i]
                evt.target.style= 'border:0px;background-color:unset';
            })
        })
    })
}
else if(data.mode.length==3){
    document.querySelectorAll('.common')[0].querySelectorAll('div')[7].innerHTML = charactersArr11[0]
    document.querySelectorAll('.common')[0].querySelector('h1').innerHTML = `النمط الرئيسي الأول: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode.slice(0,1)}</span>`
    document.querySelectorAll('.common')[0].querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
        e.addEventListener('click',(evt)=>{
            evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                elem.style=''
            })
            evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr11[i]
            evt.target.style= 'border:0px;background-color:unset';
        })
    })
    let clone = document.querySelector('.common').cloneNode(true)
    document.querySelector('.res').appendChild(clone)
    document.querySelectorAll('.common')[1].querySelectorAll('div')[7].innerHTML = charactersArr22[0]
    document.querySelectorAll('.common')[1].querySelector('h1').innerHTML = `النمط الرئيسي الثاني: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode.slice(2)}</span>`
    document.querySelectorAll('.common')[1].querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
        e.addEventListener('click',(evt)=>{
            evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                elem.style=''
            })
            evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr22[i]
            evt.target.style= 'border:0px;background-color:unset';
        })
    })
    document.querySelectorAll('aside').forEach((elmnt)=>{
        elmnt.querySelector('div').style= 'border:0px;background-color:unset';
    })
}
else if(data.mode.length==5){
    document.querySelectorAll('.common')[0].querySelectorAll('div')[7].innerHTML = charactersArr11[0]
    document.querySelectorAll('.common')[0].querySelector('h1').innerHTML = `النمط الرئيسي الأول: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode.slice(0,1)}</span>`
    document.querySelectorAll('.common')[0].querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
        e.addEventListener('click',(evt)=>{
            evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                elem.style=''
            })
            evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr11[i]
            evt.target.style= 'border:0px;background-color:unset';
        })
    })
    let clone = document.querySelector('.common').cloneNode(true)
    document.querySelector('.res').appendChild(clone)
    document.querySelectorAll('.common')[1].querySelectorAll('div')[7].innerHTML = charactersArr22[0]
    document.querySelectorAll('.common')[1].querySelector('h1').innerHTML = `النمط الرئيسي الثاني: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode.slice(2,3)}</span>`
    document.querySelectorAll('.common')[1].querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
        e.addEventListener('click',(evt)=>{
            evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                elem.style=''
            })
            evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr22[i]
            evt.target.style= 'border:0px;background-color:unset';
        })
    })
    let clone2 = document.querySelector('.common').cloneNode(true)
    document.querySelector('.res').appendChild(clone2)
    document.querySelectorAll('.common')[2].querySelectorAll('div')[7].innerHTML = charactersArr33[0]
    document.querySelectorAll('.common')[2].querySelector('h1').innerHTML = `النمط الرئيسي الثالث: <span style='color:#ffe2b4;text-shadow:0 0 2px black;'>${data.mode.slice(4)}</span>`
    document.querySelectorAll('.common')[2].querySelector('aside').querySelectorAll('div').forEach((e,i)=>{
        e.addEventListener('click',(evt)=>{
            evt.target.parentElement.querySelectorAll('div').forEach((elem,index) =>{
                elem.style=''
            })
            evt.target.parentElement.parentElement.querySelectorAll('div')[7].innerHTML = charactersArr33[i]
            evt.target.style= 'border:0px;background-color:unset';
        })
    })
    document.querySelectorAll('aside').forEach((elmnt)=>{
        elmnt.querySelector('div').style= 'border:0px;background-color:unset';
    })
}
document.querySelector('header').querySelector('h1').innerHTML+=data.name;
document.querySelector('aside').querySelector('div').style= 'border:0px;background-color:unset';
//document.querySelector('aside').querySelectorAll('div')[1].style='border-bottom-right-radius:30px'
/*************************************/

document.querySelector('#res2').querySelector('div').querySelectorAll('div')[0].innerHTML = charactersArr2[0]
document.querySelector('#res2').querySelector('div').querySelectorAll('div')[1].innerHTML = charactersArr2[1]

function r(){
    document.querySelector('#graph').style = `height:${document.querySelector('#table').clientHeight}px`
}

r()
}

